const names = [
    'Комплекс по переработке твердых радиоактивных отходов Курской АЭС',
    'Отдел радиационной безопасности',
    'Прочие организации',
    'АО НИКИМТ - Атомстрой',
    'ООО НЕОРАДТЕХ',
    'ФГУП Приборостроительный завод им. К.А.Володина',
    'АО Атомткхэнерго, Смоленский филиал',
    'ЦТАИ',
    'ЦОРО',
    'ЦЦР',
    'ЦВ',
    'Электроцех',
    'СБ',
    'ОИКТ',
]

function generateArrayForCollectiveDoses(names) {
    const shuffledNames = names.sort(() => Math.random() - 0.5)

    const currentDate = new Date()
    const startDate = new Date(2023, 8, 1)
    const endDate = new Date(
        currentDate.getFullYear(),
        currentDate.getMonth(),
        currentDate.getDate()
    )

    const objects = []

    for (let i = 0; i < 100; i++) {
        const name = shuffledNames[i % shuffledNames.length]
        const randomDate = new Date(
            startDate.getTime() +
                Math.random() * (endDate.getTime() - startDate.getTime())
        )

        const dateString = randomDate.toISOString()

        const dose = Math.random() * 0.0009

        objects.push({ name, date: dateString, dose })
    }

    return objects
}

const generedTestData = [
    {
        name: 'Прочие организации',
        date: '2024-04-15T15:41:39.022Z',
        dose: 0.00005483837440756509,
    },
    {
        name: 'СБ',
        date: '2024-01-03T14:03:01.889Z',
        dose: 0.000006192205914034621,
    },
    {
        name: 'ЦОРО',
        date: '2024-02-25T04:04:21.980Z',
        dose: 0.00021544945872937926,
    },
    {
        name: 'ЦТАИ',
        date: '2024-03-21T11:58:19.729Z',
        dose: 0.0006589080675110876,
    },
    {
        name: 'ОИКТ',
        date: '2024-02-19T17:44:51.033Z',
        dose: 0.0008321325889430276,
    },
    {
        name: 'Отдел радиационной безопасности',
        date: '2023-11-21T21:07:00.131Z',
        dose: 0.00011180430384008932,
    },
    {
        name: 'ЦЦР',
        date: '2024-04-27T13:23:59.912Z',
        dose: 0.0002618445040312547,
    },
    {
        name: 'АО Атомткхэнерго, Смоленский филиал',
        date: '2023-09-29T21:09:49.476Z',
        dose: 0.00003444518185347251,
    },
    {
        name: 'ООО НЕОРАДТЕХ',
        date: '2023-12-14T16:36:23.586Z',
        dose: 0.00041360050044776534,
    },
    {
        name: 'Комплекс по переработке твердых радиоактивных отходов Курской АЭС',
        date: '2023-12-11T18:16:44.218Z',
        dose: 0.000515167437838361,
    },
    {
        name: 'ФГУП Приборостроительный завод им. К.А.Володина',
        date: '2023-12-06T14:42:10.516Z',
        dose: 0.0005807574017156868,
    },
    {
        name: 'ЦВ',
        date: '2024-04-21T15:23:15.003Z',
        dose: 0.0005957986543714986,
    },
    {
        name: 'Электроцех',
        date: '2024-04-07T01:44:50.473Z',
        dose: 0.0004099314673587614,
    },
    {
        name: 'АО НИКИМТ - Атомстрой',
        date: '2023-11-25T11:00:09.919Z',
        dose: 0.00009969998320799868,
    },
    {
        name: 'Прочие организации',
        date: '2023-09-13T03:11:09.630Z',
        dose: 0.00003680549808638984,
    },
    {
        name: 'СБ',
        date: '2023-09-13T11:52:47.350Z',
        dose: 0.0002366811561857719,
    },
    {
        name: 'ЦОРО',
        date: '2023-11-24T02:03:03.014Z',
        dose: 0.000020106066502808682,
    },
    {
        name: 'ЦТАИ',
        date: '2023-09-11T00:57:42.094Z',
        dose: 0.0004936703874135418,
    },
    {
        name: 'ОИКТ',
        date: '2024-01-15T09:36:57.702Z',
        dose: 0.00022448985837902132,
    },
    {
        name: 'Отдел радиационной безопасности',
        date: '2024-03-15T08:52:34.961Z',
        dose: 0.000006080882446775115,
    },
    {
        name: 'ЦЦР',
        date: '2024-02-25T05:35:55.644Z',
        dose: 0.0005557249696211839,
    },
    {
        name: 'АО Атомткхэнерго, Смоленский филиал',
        date: '2024-02-12T13:36:25.810Z',
        dose: 0.0007324476470861711,
    },
    {
        name: 'ООО НЕОРАДТЕХ',
        date: '2023-11-17T03:40:20.210Z',
        dose: 0.00007292449832447001,
    },
    {
        name: 'Комплекс по переработке твердых радиоактивных отходов Курской АЭС',
        date: '2023-11-15T05:03:36.714Z',
        dose: 0.0005728541743435988,
    },
    {
        name: 'ФГУП Приборостроительный завод им. К.А.Володина',
        date: '2023-12-21T03:10:43.608Z',
        dose: 0.000545289049164021,
    },
    {
        name: 'ЦВ',
        date: '2024-01-29T04:31:34.738Z',
        dose: 0.0002510877296896014,
    },
    {
        name: 'Электроцех',
        date: '2024-03-21T01:17:12.013Z',
        dose: 0.00014314302807626902,
    },
    {
        name: 'АО НИКИМТ - Атомстрой',
        date: '2024-01-07T01:41:23.019Z',
        dose: 0.0005491483108612922,
    },
    {
        name: 'Прочие организации',
        date: '2024-02-04T01:06:38.382Z',
        dose: 5.316381073204645e-7,
    },
    {
        name: 'СБ',
        date: '2024-03-02T09:13:22.120Z',
        dose: 0.0007990697758139548,
    },
    {
        name: 'ЦОРО',
        date: '2024-03-25T10:35:07.078Z',
        dose: 0.0008639719034211099,
    },
    {
        name: 'ЦТАИ',
        date: '2023-09-25T17:45:21.210Z',
        dose: 0.00020599460027292176,
    },
    {
        name: 'ОИКТ',
        date: '2024-02-21T04:25:38.785Z',
        dose: 0.0003773240354399391,
    },
    {
        name: 'Отдел радиационной безопасности',
        date: '2024-02-06T12:15:10.584Z',
        dose: 0.000831532450472554,
    },
    {
        name: 'ЦЦР',
        date: '2024-02-09T11:20:16.539Z',
        dose: 0.0005520783146714902,
    },
    {
        name: 'АО Атомткхэнерго, Смоленский филиал',
        date: '2024-04-25T01:46:00.045Z',
        dose: 0.0007039416426422377,
    },
    {
        name: 'ООО НЕОРАДТЕХ',
        date: '2023-11-08T09:26:40.961Z',
        dose: 0.0005207256762678802,
    },
    {
        name: 'Комплекс по переработке твердых радиоактивных отходов Курской АЭС',
        date: '2024-02-28T03:07:28.075Z',
        dose: 0.00015248122249527754,
    },
    {
        name: 'ФГУП Приборостроительный завод им. К.А.Володина',
        date: '2024-01-30T10:21:47.407Z',
        dose: 0.0008148429137620123,
    },
    {
        name: 'ЦВ',
        date: '2024-03-26T05:22:54.030Z',
        dose: 0.0005460869866840424,
    },
    {
        name: 'Электроцех',
        date: '2023-12-03T12:27:21.086Z',
        dose: 0.0003182630504125114,
    },
    {
        name: 'АО НИКИМТ - Атомстрой',
        date: '2024-01-22T06:24:20.529Z',
        dose: 0.0007234531466117826,
    },
    {
        name: 'Прочие организации',
        date: '2023-11-03T08:01:03.035Z',
        dose: 0.00027200847729894994,
    },
    {
        name: 'СБ',
        date: '2023-09-22T06:08:14.248Z',
        dose: 0.0007874128300574106,
    },
    {
        name: 'ЦОРО',
        date: '2023-09-08T10:57:01.871Z',
        dose: 0.00014613329100853558,
    },
    {
        name: 'ЦТАИ',
        date: '2023-12-12T04:27:24.104Z',
        dose: 0.00010727510651714145,
    },
    {
        name: 'ОИКТ',
        date: '2023-12-04T00:10:06.479Z',
        dose: 0.0003268182796164358,
    },
    {
        name: 'Отдел радиационной безопасности',
        date: '2023-12-14T15:36:56.313Z',
        dose: 0.0006257266948780964,
    },
    {
        name: 'ЦЦР',
        date: '2024-01-26T10:56:37.580Z',
        dose: 0.0002273942929601824,
    },
    {
        name: 'АО Атомткхэнерго, Смоленский филиал',
        date: '2023-09-02T16:00:54.110Z',
        dose: 0.00002269645334654431,
    },
    {
        name: 'ООО НЕОРАДТЕХ',
        date: '2023-10-31T05:03:45.955Z',
        dose: 0.00024078780502916782,
    },
    {
        name: 'Комплекс по переработке твердых радиоактивных отходов Курской АЭС',
        date: '2024-02-05T02:34:51.581Z',
        dose: 0.00040802359966212793,
    },
    {
        name: 'ФГУП Приборостроительный завод им. К.А.Володина',
        date: '2023-10-19T04:24:56.691Z',
        dose: 0.00014459020945045876,
    },
    {
        name: 'ЦВ',
        date: '2024-02-10T06:42:14.200Z',
        dose: 0.00014790888042284737,
    },
    {
        name: 'Электроцех',
        date: '2023-12-29T18:33:15.807Z',
        dose: 0.0006903558147698974,
    },
    {
        name: 'АО НИКИМТ - Атомстрой',
        date: '2024-03-28T02:49:34.385Z',
        dose: 0.00031126823830249115,
    },
    {
        name: 'Прочие организации',
        date: '2023-10-11T10:51:45.031Z',
        dose: 0.00030560050383288785,
    },
    {
        name: 'СБ',
        date: '2024-01-31T19:53:54.473Z',
        dose: 0.000065550602861111,
    },
    {
        name: 'ЦОРО',
        date: '2024-03-31T02:05:09.511Z',
        dose: 0.00015349905029837666,
    },
    {
        name: 'ЦТАИ',
        date: '2024-04-09T20:30:30.289Z',
        dose: 0.0006395282642312971,
    },
    {
        name: 'ОИКТ',
        date: '2023-11-20T19:20:39.531Z',
        dose: 0.0007934614787353466,
    },
    {
        name: 'Отдел радиационной безопасности',
        date: '2024-04-28T08:31:58.065Z',
        dose: 0.00023466071191440057,
    },
    {
        name: 'ЦЦР',
        date: '2023-09-12T21:55:56.076Z',
        dose: 0.0002414127634177574,
    },
    {
        name: 'АО Атомткхэнерго, Смоленский филиал',
        date: '2023-12-02T05:08:55.785Z',
        dose: 0.00021365094093277748,
    },
    {
        name: 'ООО НЕОРАДТЕХ',
        date: '2024-03-21T00:15:19.787Z',
        dose: 0.00073411644779686,
    },
    {
        name: 'Комплекс по переработке твердых радиоактивных отходов Курской АЭС',
        date: '2023-12-10T23:42:15.510Z',
        dose: 0.0005875872493230972,
    },
    {
        name: 'ФГУП Приборостроительный завод им. К.А.Володина',
        date: '2023-09-18T21:28:43.184Z',
        dose: 0.0006076387986197996,
    },
    {
        name: 'ЦВ',
        date: '2023-10-14T03:38:32.141Z',
        dose: 0.0003847978523515656,
    },
    {
        name: 'Электроцех',
        date: '2023-10-20T08:18:48.922Z',
        dose: 0.0008476809016935096,
    },
    {
        name: 'АО НИКИМТ - Атомстрой',
        date: '2024-02-20T04:00:50.333Z',
        dose: 0.0005175178348420678,
    },
    {
        name: 'Прочие организации',
        date: '2024-02-18T10:15:54.481Z',
        dose: 0.00038535847268991236,
    },
    {
        name: 'СБ',
        date: '2024-02-02T23:13:35.193Z',
        dose: 0.0003438049784197014,
    },
    {
        name: 'ЦОРО',
        date: '2023-09-08T14:20:34.529Z',
        dose: 0.0008475201769345723,
    },
    {
        name: 'ЦТАИ',
        date: '2024-03-04T04:14:10.270Z',
        dose: 0.0001628712531685204,
    },
    {
        name: 'ОИКТ',
        date: '2023-11-19T12:03:25.440Z',
        dose: 0.0007942668491826705,
    },
    {
        name: 'Отдел радиационной безопасности',
        date: '2024-03-21T18:11:46.881Z',
        dose: 0.000868057117121827,
    },
    {
        name: 'ЦЦР',
        date: '2024-01-01T16:38:55.333Z',
        dose: 0.00041091442129942185,
    },
    {
        name: 'АО Атомткхэнерго, Смоленский филиал',
        date: '2023-11-30T08:34:07.265Z',
        dose: 0.0005188260653634835,
    },
    {
        name: 'ООО НЕОРАДТЕХ',
        date: '2024-04-22T16:46:05.171Z',
        dose: 0.0004109276305258701,
    },
    {
        name: 'Комплекс по переработке твердых радиоактивных отходов Курской АЭС',
        date: '2023-09-28T22:47:48.380Z',
        dose: 0.0007059583388244288,
    },
    {
        name: 'ФГУП Приборостроительный завод им. К.А.Володина',
        date: '2023-12-23T11:58:32.206Z',
        dose: 0.000690897287084485,
    },
    {
        name: 'ЦВ',
        date: '2024-03-18T13:02:53.428Z',
        dose: 0.0002573269861961593,
    },
    {
        name: 'Электроцех',
        date: '2023-11-28T23:49:35.764Z',
        dose: 0.0006732423653816808,
    },
    {
        name: 'АО НИКИМТ - Атомстрой',
        date: '2024-01-27T04:49:07.311Z',
        dose: 0.0005942724334345511,
    },
    {
        name: 'Прочие организации',
        date: '2024-01-11T15:55:14.262Z',
        dose: 0.0007403085669824474,
    },
    {
        name: 'СБ',
        date: '2024-01-15T12:16:08.590Z',
        dose: 0.000021957986910919147,
    },
    {
        name: 'ЦОРО',
        date: '2023-12-16T16:32:48.691Z',
        dose: 0.0008585319235813895,
    },
    {
        name: 'ЦТАИ',
        date: '2024-02-28T02:47:21.316Z',
        dose: 0.00006080206868044917,
    },
    {
        name: 'ОИКТ',
        date: '2023-09-14T03:29:38.763Z',
        dose: 0.0008650134707180271,
    },
    {
        name: 'Отдел радиационной безопасности',
        date: '2023-11-06T13:03:16.050Z',
        dose: 0.0005304850618364344,
    },
    {
        name: 'ЦЦР',
        date: '2023-11-21T05:28:32.068Z',
        dose: 0.0008012538462841477,
    },
    {
        name: 'АО Атомткхэнерго, Смоленский филиал',
        date: '2023-12-25T06:19:28.219Z',
        dose: 0.0005622494844752172,
    },
    {
        name: 'ООО НЕОРАДТЕХ',
        date: '2023-10-03T10:18:51.957Z',
        dose: 0.0005720616593936168,
    },
    {
        name: 'Комплекс по переработке твердых радиоактивных отходов Курской АЭС',
        date: '2024-01-10T04:46:21.232Z',
        dose: 0.00003209275158665832,
    },
    {
        name: 'ФГУП Приборостроительный завод им. К.А.Володина',
        date: '2024-02-11T05:20:44.140Z',
        dose: 0.00020407100414056585,
    },
    {
        name: 'ЦВ',
        date: '2024-01-27T21:12:28.648Z',
        dose: 0.0005654210347918723,
    },
    {
        name: 'Электроцех',
        date: '2024-04-04T18:33:16.228Z',
        dose: 0.0007267559621759203,
    },
    {
        name: 'АО НИКИМТ - Атомстрой',
        date: '2024-03-08T18:50:50.150Z',
        dose: 0.00017975179956018718,
    },
    {
        name: 'Прочие организации',
        date: '2023-11-20T10:26:08.343Z',
        dose: 0.0006748630839142722,
    },
    {
        name: 'СБ',
        date: '2024-03-04T22:59:51.435Z',
        dose: 0.0008631504780275197,
    },
]

function filterObjectsByDate(objects, startDate, endDate) {
    const filteredObjects = objects.filter((obj) => {
        const objDate = new Date(obj.date)
        return objDate >= startDate && objDate <= endDate
    })

    return filteredObjects
}

function sumDoses(objects) {
    const uniqueNames = Array.from(new Set(objects.map((obj) => obj.name)))

    const result = uniqueNames.map((name) => {
        const filteredObjects = objects.filter((obj) => obj.name === name)
        const sumDose = filteredObjects.reduce(
            (total, obj) => total + obj.dose,
            0
        )
        return { name, dose: sumDose }
    })

    return result
}

const colorArray = [
    {
        name: 'Комплекс по переработке твердых радиоактивных отходов Курской АЭС',
        color: 'rgba(54, 162, 235, 0.6)',
    },
    {
        name: 'Отдел радиационной безопасности',
        color: 'rgba(255, 99, 132, 0.6)',
    },
    { name: 'Прочие организации', color: 'rgba(255, 206, 86, 0.6)' },
    { name: 'АО НИКИМТ - Атомстрой', color: 'rgba(75, 192, 192, 0.6)' },
    { name: 'ООО НЕОРАДТЕХ', color: 'rgba(153, 102, 255, 0.6)' },
    {
        name: 'ФГУП Приборостроительный завод им. К.А.Володина',
        color: 'rgba(255, 159, 64, 0.6)',
    },
    {
        name: 'АО Атомткхэнерго, Смоленский филиал',
        color: 'rgba(218, 165, 32, 0.6)',
    },
    { name: 'ЦТАИ', color: 'rgba(34, 139, 34, 0.6)' },
    { name: 'ЦОРО', color: 'rgba(255, 140, 0, 0.6)' },
    { name: 'ЦЦР', color: 'rgba(72, 61, 139, 0.6)' },
    { name: 'ЦВ', color: 'rgba(255, 20, 147, 0.6)' },
    { name: 'Электроцех', color: 'rgba(0, 128, 0, 0.6)' },
    { name: 'СБ', color: 'rgba(128, 0, 128, 0.6)' },
    { name: 'ОИКТ', color: 'rgba(165, 42, 42, 0.6)' },
]

function mergeColors(namesArray, colorsArray) {
    const colorMap = {}
    colorsArray.forEach((obj) => {
        colorMap[obj.name] = obj.color
    })

    namesArray.forEach((obj) => {
        if (colorMap.hasOwnProperty(obj.name)) {
            obj.color = colorMap[obj.name]
        }
    })

    return namesArray
}

function createChartData(namesArray) {
    const labels = namesArray.map((obj) => obj.name)
    const doses = namesArray.map((obj) => obj.dose)
    const colors = namesArray.map((obj) => obj.color)

    return {
        labels: labels,
        datasets: [
            {
                label: 'Суммарная доза',
                data: doses,
                backgroundColor: colors.map((color) =>
                    color.replace('0.6', '0.2')
                ),
                borderColor: colors.map((color) => color.replace('0.6', '1')),
                borderWidth: 1,
            },
        ],
    }
}

module.exports = {
    names,
    generateArrayForCollectiveDoses,
    generedTestData,
    filterObjectsByDate,
    sumDoses,
    colorArray,
    mergeColors,
    createChartData,
}
