const createMonthArray = () => {
    const months = []
    const currentDate = new Date()
    const currentMonth = currentDate.getMonth()
    const currentYear = currentDate.getFullYear()

    for (let i = currentMonth; i < 12; i++) {
        months.push(
            new Date(currentYear, i).toLocaleString('default', {
                month: 'long',
            })
        )
    }

    for (let i = 0; i < currentMonth; i++) {
        months.push(
            new Date(currentYear + 1, i).toLocaleString('default', {
                month: 'long',
            })
        )
    }

    return months
}

const createArrayWithLast5Years = () => {
    const years = []
    const currentDate = new Date()
    const currentYear = currentDate.getFullYear()

    for (let i = 0; i < 5; i++) {
        years.push(currentYear - i)
    }

    return years
}

const monthsArray = createMonthArray().reverse()
const yearsArray = createArrayWithLast5Years().reverse()

const normalizedValue = [
    'эффективная доза',
    'экспозиционная доза',
    'поступление радионуклида',
    'эквивалентная доза на поверхности нижней части области живота',
    'эквивалентная доза в хрусталике глаза',
    'эквивалентная доза в кистях и стопах',
    'эквивалентная доза в коже',
]

const areaIDCData = [
    {
        id_uuid: 'a48cbbb3-32c6-4aaa-a428-598be79f27ad',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.0002697356460234585, 0, 0.00018325743773351028,
                        0.0002179715957053377, 0.000028637087678528965,
                        0.0003390562664580852, 0.00031846014997821204,
                        0.00012535769469685084, 0, 0.0002997653561673069,
                        0.0003522925006543878, 0.0003382232544554231,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '3e71b51f-e1bb-4eff-b4b5-c7459ed811fc',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00021, 0, 0.00014238452482082058,
                        0.000015473083977831148, 0.0002599454178747101,
                        0.00010091586836151032, 0, 0.000098614900071808, 0,
                        0.000023460063850016822, 0.00023290620468030727,
                        0.00024822773529309205,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'a3a5c389-37db-49b7-a3de-fc02e5790676',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00011683641102349247, 0.0001729753652992146,
                        0.00032642997839862, 0.00021298775054951708,
                        0.00021559272764229545, 0.0001383929262309789,
                        0.00007109801588532303, 0.0002617803961657457, 0,
                        0.00022491084769841153, 0.00013516632356590146, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'a5402bd0-cf60-40a1-8168-fdfa55fbbb8f',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0.0003262926752669422, 0, 0, 0,
                        0.00014395938270595255, 0, 0.0001053317371392082, 0, 0,
                        0, 0.0002416964720570356,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'f0053634-351d-44c0-bd7b-11259d51215c',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0.0003578785736116442, 0.00003046758312143741, 0,
                        0.0002364203503458964, 0, 0.000005006919854972711, 0,
                        0.00006406562895717319, 0, 0, 0.000032018151621866515,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '32832d52-4651-4cfd-8d08-4fccfba71065',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.000014703240318502894, 0.0003203665819556781,
                        0.0001741546252422078, 0, 0.0003316815742437414,
                        0.000004991466106956808, 0, 0.0003507454827448702, 0,
                        0.000359442209960567, 0, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'a9ea7efd-dc62-4936-b10a-6ab30afdc746',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00034145929156831627, 0.0003618321710155971, 0,
                        0.00028555118223342257, 0.000269881520403039,
                        0.00006901751314736026, 0.0002971592324942198,
                        0.0002160488965315872, 0.000132670079486552, 0, 0,
                        0.00014971760910866748,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '9e795320-05ac-4b8d-87c9-ffb2a8553249',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0.0002790104133016102, 0.00024794595353557744, 0,
                        0.000154954362284508, 0.00025523111221894325,
                        0.00020070095578600053, 0.00015892304909028197,
                        7.034501704908002e-8, 0.00015957958540109332,
                        0.00025475308823092434, 0.00011178704855486582,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'e6959562-765b-46b8-adf4-ac73666b0e3b',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.0003191101837390664, 0.00025718560458747817, 0,
                        0.00024838801759916393, 0.00004246533407045214, 0,
                        0.00011279692166805597, 0, 0, 0.0002817167918424758, 0,
                        0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '91c18930-90f6-440d-811d-a0cf607caae9',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.000340345066586653, 0.0001535098540491586,
                        0.00005170374434490426, 0.00005125845881459437,
                        0.0002949852456515538, 0.0003321131695355182, 0,
                        0.00032761553831405627, 0.0000501138810549471,
                        0.00000315236417279504, 0, 0.0001611710365601613,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '29031718-626e-47c4-9841-738e8393cbea',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0.0002245087293579689, 0.0001311157546095401,
                        0.00020869360494426564, 0, 0.00015957289610957017, 0,
                        0.000289933290135737, 0, 0.0001794642782728373,
                        0.00027403603169587034, 0.00006980566018979252,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '5ffab5db-3591-4def-ab08-ea9a3773989d',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.0003567726870113368, 0.00005944414548414077, 0,
                        0.0003518359276053751, 0, 0.00011413635957018989, 0,
                        0.000002869440545291013, 0.0001216768438697064,
                        0.00012660068834601483, 0.00023547449161501386,
                        0.00014447800367624076,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'ff9f3947-6ef6-4aec-b733-3bb16b400bf9',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0.000278050505536201, 0.00013893763864462143, 0,
                        0.00007839955287797835, 0, 0, 0, 0, 0,
                        0.0002705080420768451, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '4b5f855f-ca3e-4aaf-9461-6d89ebc0178a',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0.00021271089577469966, 0, 0.00015136548496159436, 0,
                        0, 0.0001759404690018536, 0.000048328847940716295, 0,
                        0.00006395118210220671, 0.0002733759446663916,
                        0.00009122168096736343,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '66af964d-0c1c-41fa-bc3f-78d90821f608',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00006123710332396455, 0.00016683023918439554, 0, 0, 0,
                        0.00001842814503141084, 0, 0.0001649042894188433,
                        0.00020029493142317375, 0, 0, 0.0003396902169353047,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'f4c835d8-5d04-4cee-91c5-a0f3f4c2380f',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00035935511989464836, 0, 0, 0.00022540400242487368, 0,
                        0, 0, 0.0000944516643369243, 0.00005093235467397574, 0,
                        0.00006719653886012277, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'd13beb7b-8011-477a-83a7-80ae28682e32',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.000012178615089435893, 0.00029029316008844283,
                        0.00027505346726849087, 0, 0.000009515681730121491,
                        0.00017626777495523908, 0.0003475466600590114, 0,
                        0.000012312310941230991, 0.00008612306510966491,
                        0.000164199624313271, 0.00017875611179158168,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '7e162c41-7c21-4511-9f71-01de24ae89a9',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00023051727150969842, 0, 0, 0, 0.00019210475488235898,
                        0.0003052574406743481, 0.0001876891672853728,
                        0.00013968960672511811, 0, 0.0003396868217137229,
                        0.0000169895106475558, 0.00023334266729565842,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '2bf11d19-dcbd-4926-bbe7-614b2b9bdfcd',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00026864444122828764, 0.00006492072262413499, 0,
                        0.000053483567230925814, 0.00017420707189197722,
                        0.00034008973632010164, 0.00008987900500711932,
                        0.00009737891526620954, 0.0003162905951289603,
                        0.000010046241343854219, 0, 0.0003275331245001777,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '686ac35f-28de-4919-83b3-7244a132cfab',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0, 0, 0.00015091952989932037, 0, 0,
                        0.00016434110060512463, 0.00030009743256349027,
                        0.00009403313561477952, 0.00011591038906761965, 0, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'fff9f78a-1131-4898-9a30-61d226bea566',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0.000004846347151727326, 0.0003100474332776401,
                        0.00022246897868357846, 0, 0.000008965779683926047,
                        0.00031846199791712293, 0, 0.00012703812560614427, 0, 0,
                        0.0003629621724713571,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'ac2d4fb6-0709-43a0-a16c-3537cd4b5b56',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.000021302734897201026, 0.0002580363287076027, 0, 0,
                        0.00015430458694960358, 0, 0, 0, 0.00026900792036467085,
                        0.0002328693333060369, 0.00011177893210596362,
                        0.00007785025870916293,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'f1796132-5e2b-4ed4-99e3-5d8473ac8164',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.000012500292001752158, 0.000269176315709495,
                        0.00019471874532666722, 0.0002681967467795109, 0, 0, 0,
                        0.00015960016448047997, 0.00018012487675279532, 0, 0,
                        0.00008599910475907835,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'a21e5ebb-846f-4842-a3a1-380440c1e19e',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00014973647874982446, 0, 0.00036084828704219127,
                        0.00010577567740576905, 0.00023854594633393247,
                        0.00027607907652376756, 0.000015003823868811702,
                        0.00020520958089796965, 0.00032562815156553416,
                        0.00015302200795661367, 0.00030756857411232515,
                        0.0002979361822994358,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '2f02ec00-58dd-40b1-a74c-a4723dac4107',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0.00018961061205314061, 0.0001354728241457997,
                        0.00014897903510270773, 0.00012983777469059842,
                        0.00034973170748777235, 0, 0.00031278169347604854, 0, 0,
                        0.000011850587011858291, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '87c8036c-275e-4488-a0d7-6adae9d6fdd1',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.000018294548375462333, 0.00008126093819673495,
                        0.00031207291401768857, 0.00024016610340879308,
                        0.000245434466063006, 0.00027765872527138247,
                        0.00009223759884935586, 0, 0.00010780356076847575,
                        0.00004750672223785886, 0.00026924544508537994,
                        0.00014814753049256237,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '59468f00-12d1-4b0b-8057-5cd2b4baf38c',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00003302327234335038, 0, 0.0002057481055072443, 0,
                        0.00016942514591613086, 0.000360140117125981, 0,
                        0.00014751370562789563, 0, 0.0001426964401702527,
                        0.00029714339685381157, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '89e3aabb-8ecc-45a8-a5c8-4e7f24004687',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0, 0, 0.0001642333882268322, 0,
                        0.00008201997564247218, 0, 0.00029263777001417953,
                        0.00032010265852687453, 0.00007306951167471332,
                        0.00015301210662181487, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '1817c646-7e2b-4ddb-bf01-dc1e5fd9f98d',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.0002815179390471065, 0.00005466005801460776,
                        0.00003689790488724354, 0.00034140803049978187,
                        0.000197576835350257, 0.00016919865747190438,
                        0.00009347637409604589, 0.0001429397412753439,
                        0.00004466548100908242, 0.000272009123868274, 0,
                        0.0002222074348389334,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '2603a5e5-ac4f-4385-af2a-3cd7e7f083f1',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00017839457065084219, 0.0003229430095644226,
                        0.00033170746852309027, 0, 0, 0.00014676536643061508,
                        0.000030561445206610565, 0, 0, 0,
                        0.00024277981890237043, 0.0001277421002921982,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'c6e5ccba-3413-49ec-9008-c53dd3d3f519',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00034158902728023444, 0, 0, 0.00031625220187783064,
                        0.0003157909299773506, 0, 0.00036489941652900884, 0,
                        0.00012377745880187406, 0.00017107934335119706,
                        0.00023352505827541108, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '1f679ae6-e8d4-464d-a5e1-488fdf8a6fb7',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00018156216830524658, 0.00024827127796168394, 0,
                        0.00004195838413435993, 0.00004592022206016388,
                        0.00032924138461911577, 0, 0.000025819774286612705,
                        0.00014255279582962112, 0, 0, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'f29fb133-dc95-4583-9edc-f9ec83dd501d',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0, 0.000029805045457724997, 0.0001920676066992552,
                        0.00005459557015651637, 0, 0.000015882945285560244,
                        0.00017205565622566333, 0.000008606824631060768,
                        0.000035493390725085045, 0.00006298923447919061,
                        0.00014034292730810094, 0,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '81de7ce2-6cb8-4efb-a2c3-e4d77ec8f82a',
        info: {
            labels: monthsArray,
            datasets: [
                {
                    fill: true,
                    label: 'Доза',
                    data: [
                        0.00030036377708938177, 0, 0, 0, 0,
                        0.00007629335046095199, 0, 0.0002256047494913245, 0, 0,
                        0.00007544157076249715, 0.00023251513776850497,
                    ],
                    borderColor: 'rgb(53, 162, 235)',
                    backgroundColor: 'rgba(53, 162, 235, 0.5)',
                },
            ],
        },
    },
]

const barIDCData = [
    {
        id_uuid: 'a48cbbb3-32c6-4aaa-a428-598be79f27ad',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0008241280659297684, 0.00045149195909693543,
                        0.0007976373391693635, 0.0004321113365258625,
                        0.00004625566703503,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '3e71b51f-e1bb-4eff-b4b5-c7459ed811fc',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00023376104999506215, 0.00044728764884951864,
                        0.0006643689440175092, 0.0002395577467777778,
                        0.0009426057009349971,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'a3a5c389-37db-49b7-a3de-fc02e5790676',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0003258983945844545, 0.0007160656492093025,
                        0.0007999011900510751, 0.0003698948815606059,
                        0.000569020218044812,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'a5402bd0-cf60-40a1-8168-fdfa55fbbb8f',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0006342975822444296, 0.0005461537209089174,
                        0.0003608532332281957, 0.00006530077509001404,
                        0.0007819473429148025,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'f0053634-351d-44c0-bd7b-11259d51215c',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00041828874275768083, 0.00021775543811372423,
                        0.0003189472353534596, 0.0007505728369683381,
                        0.0005420229800426202,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '32832d52-4651-4cfd-8d08-4fccfba71065',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00028662160273475304, 0.0006477437568409994,
                        0.0006303032436015031, 0.0005108031966359822,
                        0.0002368374523513301,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'a9ea7efd-dc62-4936-b10a-6ab30afdc746',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0005347681837254588, 0.000014430450282198972,
                        0.00045059793890149736, 0.00016936474242668534,
                        0.000370901044967332,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '9e795320-05ac-4b8d-87c9-ffb2a8553249',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0007751512372339033, 0.00005346201334428262,
                        0.0004537984461036551, 0.00003640283421366847,
                        0.0006984495432906055,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'e6959562-765b-46b8-adf4-ac73666b0e3b',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0007417416865025102, 0.0007138560507619829,
                        0.00013277886593005927, 0.0006255363275569372,
                        0.000763868938318328,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '91c18930-90f6-440d-811d-a0cf607caae9',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.000541430146666972, 0.00021929335953769054,
                        0.0005815280169396031, 0.00011017965112342567,
                        0.0006771009362033646,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '29031718-626e-47c4-9841-738e8393cbea',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0005239784327183485, 0.00034659963019922663,
                        0.0006886638757823716, 0.00036547414239130016,
                        0.000418062142677408,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '5ffab5db-3591-4def-ab08-ea9a3773989d',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0007453818003551547, 0.0000726934573216566,
                        0.00016917997263321842, 0.0005864841815491381,
                        0.000852024636091056,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'ff9f3947-6ef6-4aec-b733-3bb16b400bf9',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0007038219234979916, 0.0008573399075452899,
                        0.0007524160768035492, 0.00014596429471815968,
                        0.0007095876057189815,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '4b5f855f-ca3e-4aaf-9461-6d89ebc0178a',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0007086276079231147, 0.0008505713917085581,
                        0.0007259373953757827, 0.0001687464152704211,
                        0.0005136922660361813,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '66af964d-0c1c-41fa-bc3f-78d90821f608',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0007805544143454055, 0.00021383352286528752,
                        0.0008601013117084528, 0.0006688968001401428,
                        0.000105821634425619,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'f4c835d8-5d04-4cee-91c5-a0f3f4c2380f',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0004937159395160828, 0.00008389446965903057,
                        0.0002907352304293689, 0.0006539370194776393,
                        0.0005719348067812356,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'd13beb7b-8011-477a-83a7-80ae28682e32',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00015043917025000776, 0.00007372580405905685,
                        0.0005648644022758204, 0.0008654457866179695,
                        0.0006264581772228506,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '7e162c41-7c21-4511-9f71-01de24ae89a9',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00006415002166306515, 0.0008024699099020212,
                        0.00036943032326010837, 0.00008625565813669909,
                        0.0005181689193602437,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '2bf11d19-dcbd-4926-bbe7-614b2b9bdfcd',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0007016297490977613, 0.0002836604913087491,
                        0.00042056414392225287, 0.00021017862767551954,
                        0.0001410024637452583,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '686ac35f-28de-4919-83b3-7244a132cfab',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0005469023142153162, 0.0006586561795220781,
                        0.0006801684965990185, 0.0006624012576910048,
                        0.0002444552299417256,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'fff9f78a-1131-4898-9a30-61d226bea566',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0006192016522524122, 0.000720915463046515,
                        0.0007656489170607781, 0.0003001871651397208,
                        0.000608705093767306,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'ac2d4fb6-0709-43a0-a16c-3537cd4b5b56',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0003374740122060464, 0.00028300745873419174,
                        0.0003934188601628923, 0.00004138913552239305,
                        0.0005397579664949989,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'f1796132-5e2b-4ed4-99e3-5d8473ac8164',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00003045484445694686, 0.00031190196154570163,
                        0.00024886523810657945, 0.0003671488665275717,
                        0.000669696737727722,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'a21e5ebb-846f-4842-a3a1-380440c1e19e',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.000818950102650783, 0.0005555088785457348,
                        0.0006375382200913865, 0.0008166165548096642,
                        0.0004933430611213263,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '2f02ec00-58dd-40b1-a74c-a4723dac4107',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.000019860536826388233, 0.000255506969869509,
                        0.0004464263144658382, 0.0006345082332840972,
                        0.000340667691929308,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '87c8036c-275e-4488-a0d7-6adae9d6fdd1',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0006256563468225435, 0.00019474335958639618,
                        0.0008378007608487706, 0.00026823131938955415,
                        0.0003852422939914008,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '59468f00-12d1-4b0b-8057-5cd2b4baf38c',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0005386956952337011, 0.0006889267184633003,
                        0.0007458212985769297, 0.0007587001351902079,
                        0.0004655347426932427,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '89e3aabb-8ecc-45a8-a5c8-4e7f24004687',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00054579918729976, 0.00037652871955989105,
                        0.00003901307879676224, 0.0007558884565036024,
                        0.0004699098272322334,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '1817c646-7e2b-4ddb-bf01-dc1e5fd9f98d',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0006554787872534928, 0.00036390520192794873,
                        0.00011549902594806924, 0.00044665152263259476,
                        0.0009367365442720916,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '2603a5e5-ac4f-4385-af2a-3cd7e7f083f1',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0002267575781116344, 0.000697859396303813,
                        0.000013727180464951086, 0.0008366537099731856,
                        0.0008769179020726536,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'c6e5ccba-3413-49ec-9008-c53dd3d3f519',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.000303309245344641, 0.00004834498517091519,
                        0.000539237578811721, 0.00002440246069295977,
                        0.000777742866828807,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '1f679ae6-e8d4-464d-a5e1-488fdf8a6fb7',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0006735370507113972, 0.0005468832625163027,
                        0.000828780099085709, 0.0003653025187490034,
                        0.0004440570369099698,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: 'f29fb133-dc95-4583-9edc-f9ec83dd501d',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0007726176529875156, 0.0003698119646839667,
                        0.000018234366256600855, 0.00026594766599161715,
                        0.0006725698261791068,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
    {
        id_uuid: '81de7ce2-6cb8-4efb-a2c3-e4d77ec8f82a',
        info: {
            labels: yearsArray,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0004999389422556009, 0.000010530507637919965,
                        0.00003088609364260869, 0.0002598401541189842,
                        0.0008044468108284203,
                    ],
                    backgroundColor: 'rgba(255, 99, 132, 0.5)',
                },
            ],
        },
    },
]

const bgPieColor = [
    'rgba(255, 99, 132, 0.6)',
    'rgba(54, 162, 235, 0.6)',
    'rgba(179, 177, 175, 0.6)',
    'rgba(255, 206, 86, 0.6)',
    'rgba(255, 159, 64, 0.6)',
    'rgba(153, 102, 255, 0.6)',
    'rgba(75, 192, 192, 0.6)',
    'rgba(166, 245, 236, 0.6)',
]

const pieIDCData = [
    {
        id_uuid: 'a48cbbb3-32c6-4aaa-a428-598be79f27ad',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0, 0.00019135901342413428, 0, 0.00010154657413581343,
                        0.00010643324826032315, 0.00006133015819593442,
                        0.0001770150218306447,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '3e71b51f-e1bb-4eff-b4b5-c7459ed811fc',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0000724124380012027, 0.0001097162985277866, 0, 0, 0,
                        0.00008742727629998876, 0.00019437711493044765,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'a3a5c389-37db-49b7-a3de-fc02e5790676',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00009456839997943036, 0, 0.00012691524623785353, 0, 0,
                        0, 0.00016066289160874533,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'a5402bd0-cf60-40a1-8168-fdfa55fbbb8f',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00019820747297767, 0, 0.00018399037309579038, 0,
                        0.00017410606825085388, 0.00007772539464347195,
                        0.000022800055196189374,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'f0053634-351d-44c0-bd7b-11259d51215c',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00008210375437392373, 0.00007881281792817512,
                        0.000126862566134136, 0.000024449106471788928,
                        0.0001643535002564656, 0.00006134830746554316,
                        0.00008790976818410808,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '32832d52-4651-4cfd-8d08-4fccfba71065',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0, 0, 0.00017739632721239912, 0.00015726696311604927, 0,
                        0.00013968924512784803, 0.000022082576879022175,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'a9ea7efd-dc62-4936-b10a-6ab30afdc746',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        3.714072784826161e-7, 0.00010203203812528306, 0,
                        0.00007652992932907345, 0.000022533559774163514,
                        0.0000012870427712560862, 0.00016506282819525513,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '9e795320-05ac-4b8d-87c9-ffb2a8553249',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00012564607965689505, 0.000011298369208094306,
                        0.00006235849572858054, 0.00006228270662229956,
                        0.000051155907015949924, 0, 0.00011907490702886996,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'e6959562-765b-46b8-adf4-ac73666b0e3b',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0, 0.000009061699572581982, 0, 0,
                        0.00011234021650310488, 0.00015048673793710148,
                        0.00014815626023015877,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '91c18930-90f6-440d-811d-a0cf607caae9',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0001925307763415653, 0.0001022419587827554, 0, 0, 0,
                        0, 0.00019258435984844522,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '29031718-626e-47c4-9841-738e8393cbea',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00015496769210069736, 0.00009812960468619659,
                        0.00007791204084446921, 0, 0.00011063703482383325,
                        0.00012330125458122617, 0.00016233973200637945,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '5ffab5db-3591-4def-ab08-ea9a3773989d',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0001848053035675425, 0, 0.00017348027863194485, 0,
                        0.00009622517318059219, 0.00008909253693875772,
                        0.00012627421994813358,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'ff9f3947-6ef6-4aec-b733-3bb16b400bf9',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00005363522952497908, 0.000015701652328243744,
                        0.000002623375123095828, 0.00014320339263007088,
                        0.00012485890796192162, 0, 0.00018531531744271908,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '4b5f855f-ca3e-4aaf-9461-6d89ebc0178a',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00010285282042662152, 0.00015624072371583472, 0, 0, 0,
                        0.00015275462939052194, 0.00018216919725215207,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '66af964d-0c1c-41fa-bc3f-78d90821f608',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00004484965469010756, 0, 0, 0.000006751072516253132,
                        0.000010858446002527167, 0, 0.000013908483512801606,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'f4c835d8-5d04-4cee-91c5-a0f3f4c2380f',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00004348623945414057, 0, 0.00018093343019995114, 0,
                        0.00006740132630500168, 0, 0.0001103173551072469,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'd13beb7b-8011-477a-83a7-80ae28682e32',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.000005327768350198659, 0.00004041276708499399,
                        0.00017795784088179127, 0, 0.00011657322098238256, 0,
                        0.00007475114253529704,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '7e162c41-7c21-4511-9f71-01de24ae89a9',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00008525021012317128, 0.00011089010206227728,
                        0.00017181666446928738, 0.00019726936021962713,
                        0.00007327784250024699, 0.00006673536190103416,
                        0.00010434006575318655,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '2bf11d19-dcbd-4926-bbe7-614b2b9bdfcd',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0, 0.00014147645636734279, 0, 0.00015929517497242988, 0,
                        0.0000572313122172655, 0.00015556955984977834,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '686ac35f-28de-4919-83b3-7244a132cfab',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0, 0.000138514234724246, 0, 0.00011775621346301738,
                        0.0001335709703207979, 0, 0.00013201044990997148,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'fff9f78a-1131-4898-9a30-61d226bea566',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.0001831241898631521, 0.0000011396868304493158,
                        0.0000500038067876111, 0.00012730591032012324,
                        0.00015895913033943653, 0.00017415811339459145,
                        0.00016988296032966212,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'ac2d4fb6-0709-43a0-a16c-3537cd4b5b56',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00007464866785115674, 0.000057527342353986116,
                        0.00012369631607822839, 0, 0.00014239655450898453, 0,
                        0.000018903999043023935,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'f1796132-5e2b-4ed4-99e3-5d8473ac8164',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0, 0.00009415930458935709, 0.00013156223820891386, 0, 0,
                        0, 0.00010195480160206567,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'a21e5ebb-846f-4842-a3a1-380440c1e19e',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00018450374200475826, 0, 0, 0, 0,
                        0.000031723505001210263, 0.00007891449050069746,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '2f02ec00-58dd-40b1-a74c-a4723dac4107',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00009630676445763742, 0.0001475258104206986,
                        0.0001303803773087171, 0.000047207096810808926,
                        0.00014416292030686506, 0.0001600102968732056,
                        0.00017826928053696052,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '87c8036c-275e-4488-a0d7-6adae9d6fdd1',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0, 0, 0, 0, 0.00006726694723293205,
                        0.00005612926202464319, 0.00004661710657276483,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '59468f00-12d1-4b0b-8057-5cd2b4baf38c',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00018403872016942114, 0.000020258043381522975,
                        0.00005561167498281812, 0.000005655702388911887,
                        0.00013832380633039946, 0.00010444515231083358,
                        0.00018334934395482528,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '89e3aabb-8ecc-45a8-a5c8-4e7f24004687',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00001345679452672286, 0.00008892696541617716,
                        0.00003544011839809365, 0.00011434824008724399,
                        0.00013820758014013382, 0.000057715044482933035,
                        0.00011195601134461227,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '1817c646-7e2b-4ddb-bf01-dc1e5fd9f98d',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00016591285454010564, 0.00005965337133976419,
                        0.00015042131771884773, 0.000026371709728853123,
                        0.0001695841841728412, 0.0001290121165988009,
                        0.000006698762311444373,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '2603a5e5-ac4f-4385-af2a-3cd7e7f083f1',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0, 0, 0.00003421458938913728, 0.00013875223073667078, 0,
                        0.00016365175947143893, 0.00008438248754299655,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'c6e5ccba-3413-49ec-9008-c53dd3d3f519',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0, 0.0001837225333335701, 0.000046384491332348256,
                        0.0000300401678332745, 0.00019482054453767375,
                        0.0000015535323706504124, 0.00007181543440665816,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '1f679ae6-e8d4-464d-a5e1-488fdf8a6fb7',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        7.340081515879948e-7, 0.00010750301118548698, 0,
                        0.00015817635684413345, 0, 0.00012674612717879469,
                        0.00012533409075344486,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: 'f29fb133-dc95-4583-9edc-f9ec83dd501d',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00019661755817637494, 0.000053757257020645354,
                        0.000009001820243931613, 0.00005798690369833155, 0, 0,
                        0.00001636205513976421,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
    {
        id_uuid: '81de7ce2-6cb8-4efb-a2c3-e4d77ec8f82a',
        info: {
            labels: normalizedValue,
            datasets: [
                {
                    label: 'Доза',
                    data: [
                        0.00008150825232742528, 0.00011036109300902184,
                        0.00015664041465210558, 0.00017585727312988803,
                        0.00002398851437742158, 0, 0.00003960976126810949,
                    ],
                    backgroundColor: bgPieColor,
                    borderColor: bgPieColor,
                    borderWidth: 1,
                },
            ],
        },
    },
]

module.exports = {
    areaIDCData,
    barIDCData,
    pieIDCData,
}
